zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XSPI.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XSPI
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XSPI_H_)  /* Check if memory map has not been already included */
#define S32K566_XSPI_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XSPI_Peripheral_Access_Layer XSPI Peripheral Access Layer
 * @{
 */

/** XSPI - Size of Registers Arrays */
#define XSPI_BUFIND_COUNT                         3u
#define XSPI_DLLCR_COUNT                          1u
#define XSPI_DLSR_ARRAY_COUNT                     1u
#define XSPI_SFMTA_COUNT                          1u
#define XSPI_SFMTA_SFM_COUNT                      2u
#define XSPI_FAIL_ADDR_ARRAY_COUNT                1u
#define XSPI_RBDR_ARRAY_COUNT                     64u
#define XSPI_LUT_COUNT                            80u
#define XSPI_BUFN_M_ADDR_RANGE_COUNT              4u
#define XSPI_BUFN_M_ADDR_RANGE_BUFN_M_ADDR_RANGE_COUNT 4u
#define XSPI_AHB_PERF_BUFN_COUNT                  4u
#define XSPI_IPEDCTXXIV_IPEDCTXXIVY_COUNT         2u
#define XSPI_IPEDCTXXIV_IPEDCTXXAADY_COUNT        2u
#define XSPI_IPEDCTXXIV_COUNT                     16u
#define XSPI_IPEDCTXCTRLX_COUNT                   2u
#define XSPI_SFP_LUT_EN_ARRAY_COUNT               2u
#define XSPI_SUB_REG_MDAM_ARRAY_COUNT             1u

/** XSPI - Register Layout Typedef */
typedef struct XSPI_Struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  uint8_t RESERVED_0[4];
  __I  uint32_t IPCR;                              /**< IP Configuration, offset: 0x8 */
  __IO uint32_t FLSHCR;                            /**< Flash Memory Configuration, offset: 0xC */
  __IO uint32_t BUF0CR;                            /**< Buffer Configuration, offset: 0x10 */
  __IO uint32_t BUF1CR;                            /**< Buffer Configuration, offset: 0x14 */
  __IO uint32_t BUF2CR;                            /**< Buffer Configuration, offset: 0x18 */
  __IO uint32_t BUF3CR;                            /**< Buffer Configuration, offset: 0x1C */
  __IO uint32_t BFGENCR;                           /**< Buffer Generic Configuration, offset: 0x20 */
  __IO uint32_t SOCCR;                             /**< SOC Configuration, offset: 0x24 */
  uint8_t RESERVED_1[8];
  __IO uint32_t BUFIND[XSPI_BUFIND_COUNT];         /**< Buffer 0 Top Index..Buffer 2 Top Index, array offset: 0x30, array step: 0x4 */
  uint8_t RESERVED_2[16];
  __IO uint32_t PRW_RDSR;                          /**< Page Read Wait Status, offset: 0x4C */
  __IO uint32_t AWRCR;                             /**< AHB Write Configuration, offset: 0x50 */
  __IO uint32_t ARDCR;                             /**< AHB Read Configuration, offset: 0x54 */
  __IO uint32_t AWITO;                             /**< AHB Write Idle Timeout Configuration, offset: 0x58 */
  __IO uint32_t FSR_ADDR;                          /**< Flash Status Register Address, offset: 0x5C */
  __IO uint32_t DLLCR[XSPI_DLLCR_COUNT];           /**< DLL Flash Memory A Configuration, array offset: 0x60, array step: 0x4 */
  uint8_t RESERVED_3[8];
  __IO uint32_t PARITYCR;                          /**< Parity Configuration, offset: 0x6C */
  uint8_t RESERVED_4[144];
  __I  uint32_t SFAR;                              /**< Serial Flash Memory Address, offset: 0x100 */
  __IO uint32_t SFACR;                             /**< Serial Flash Memory Address Configuration, offset: 0x104 */
  __IO uint32_t SMPR;                              /**< Sampling, offset: 0x108 */
  __I  uint32_t RBSR;                              /**< RX Buffer Status, offset: 0x10C */
  __IO uint32_t RBCT;                              /**< RX Buffer Control, offset: 0x110 */
  uint8_t RESERVED_5[12];
  __I  uint32_t AWRSR;                             /**< AHB Write Status, offset: 0x120 */
  uint8_t RESERVED_6[8];
  __I  uint32_t DLLSR;                             /**< DLL Status, offset: 0x12C */
  __IO uint32_t DLCR;                              /**< Data Learning Configuration, offset: 0x130 */
  __I  uint32_t DLSR_F[XSPI_DLSR_ARRAY_COUNT];     /**< Data Learning Status Flash Memory, array offset: 0x134, array step: 0x4 */
  uint8_t RESERVED_7[24];
  __I  uint32_t TBSR;                              /**< TX Buffer Status, offset: 0x150 */
  __IO uint32_t TBDR;                              /**< TX Buffer Data, offset: 0x154 */
  __IO uint32_t TBCT;                              /**< TX Buffer Control, offset: 0x158 */
  __I  uint32_t SR;                                /**< Status, offset: 0x15C */
  __IO uint32_t FR;                                /**< Flag, offset: 0x160 */
  __IO uint32_t RSER;                              /**< Interrupt and DMA Request Enable, offset: 0x164 */
  __I  uint32_t SPNDST;                            /**< Sequence Suspend Status, offset: 0x168 */
  __IO uint32_t SPTRCLR;                           /**< Sequence Pointer Clear, offset: 0x16C */
  uint8_t RESERVED_8[16];
  __IO uint32_t SFAD[XSPI_SFMTA_COUNT][XSPI_SFMTA_SFM_COUNT]; /**< Serial Flash Memory Top Address, array offset: 0x180, array step: index*0x8, index2*0x4 */
  uint8_t RESERVED_9[8];
  __IO uint32_t DLPR;                              /**< Data Learning Pattern, offset: 0x190 */
  __I  uint32_t FAIL_ADDR[XSPI_FAIL_ADDR_ARRAY_COUNT]; /**< Flash Memory A Failing Address Status, array offset: 0x194, array step: 0x4 */
  uint8_t RESERVED_10[104];
  __I  uint32_t RBDR[XSPI_RBDR_ARRAY_COUNT];       /**< RX Buffer Data, array offset: 0x200, array step: 0x4 */
  __IO uint32_t LUTKEY;                            /**< LUT Key, offset: 0x300 */
  __IO uint32_t LCKCR;                             /**< LUT Lock Configuration, offset: 0x304 */
  uint8_t RESERVED_11[8];
  __IO uint32_t LUT[XSPI_LUT_COUNT];               /**< Lookup Table, array offset: 0x310, array step: 0x4 */
  uint8_t RESERVED_12[48];
  __IO uint32_t BUF_ADDR_RANGE[XSPI_BUFN_M_ADDR_RANGE_COUNT][XSPI_BUFN_M_ADDR_RANGE_BUFN_M_ADDR_RANGE_COUNT]; /**< AHB Buffer 0 Sub Buffer 0 Start and End Address Range..AHB Buffer 3 Sub Buffer 3 Start and End Address Range, array offset: 0x480, array step: index*0x10, index2*0x4 */
  __I  uint32_t AHB_BUF_STATUS;                    /**< AHB Buffer Status, offset: 0x4C0 */
  __IO uint32_t AHB_PERF_CTRL;                     /**< AHB Buffer Hit/Miss Performance Monitor Control, offset: 0x4C4 */
  __I  uint32_t AHB_PERF_TIME_CNT;                 /**< AHB Performance Monitor Time Counter, offset: 0x4C8 */
  __I  uint32_t AHB_PERF_BUF[XSPI_AHB_PERF_BUFN_COUNT]; /**< AHB Buffer 0 Performance Monitor..AHB Buffer 3 Performance Monitor, array offset: 0x4CC, array step: 0x4 */
  __IO uint32_t AHRDYTO;                           /**< AHB HREADY Timeout, offset: 0x4DC */
  __IO uint32_t AHB_ERR_PAYLOAD_HI;                /**< AHB Error Payload High, offset: 0x4E0 */
  __IO uint32_t AHB_ERR_PAYLOAD_LO;                /**< AHB Error Payload Low, offset: 0x4E4 */
  __I  uint32_t AHB_RD_ERR_ADDR;                   /**< AHB Read Error Address, offset: 0x4E8 */
  __I  uint32_t AHB_RD_ERR_MID;                    /**< AHB Read Error Initiator ID, offset: 0x4EC */
  __I  uint32_t SPNDST_ADDR;                       /**< Suspend Transaction Address, offset: 0x4F0 */
  __IO uint32_t PPWF_TCNT;                         /**< Page Program Wait Time Counter, offset: 0x4F4 */
  __IO uint32_t PPW_RDSR;                          /**< Page Program Wait Read Status, offset: 0x4F8 */
  uint8_t RESERVED_13[36];
  struct XSPI_IPEDCTXXIV {                         /* offset: 0x520, array step: 0x20 */
    __IO uint32_t IPEDCTXIV[XSPI_IPEDCTXXIV_IPEDCTXXIVY_COUNT];   /**< IPED Context Initial Vector, array offset: 0x520, array step: index*0x20, index2*0x4 */
    __IO uint32_t IPEDCTXSTART;                      /**< IPED Start Address Region, array offset: 0x528, array step: 0x20 */
    __IO uint32_t IPEDCTXEND;                        /**< IPED End Address Region, array offset: 0x52C, array step: 0x20 */
    __IO uint32_t IPEDCTXAAD[XSPI_IPEDCTXXIV_IPEDCTXXAADY_COUNT];   /**< IPED Context Additional Authentication Data, array offset: 0x530, array step: index*0x20, index2*0x4 */
    uint8_t RESERVED_0[8];
  } IPEDCTXXIV[XSPI_IPEDCTXXIV_COUNT];
  __IO uint32_t IPEDCTRL;                          /**< IPED Function Control, offset: 0x720 */
  uint8_t RESERVED_14[4];
  __IO uint32_t IPEDCTXCTRL[XSPI_IPEDCTXCTRLX_COUNT]; /**< IPED Context Control 0..IPED Context Control 1, array offset: 0x728, array step: 0x4 */
  uint8_t RESERVED_15[80];
  __I  uint32_t AWR_WRAP_STATUS;                   /**< AHB Write Wrap Status, offset: 0x780 */
  __I  uint32_t AHB_WW_ERR_ADDR_EBT;               /**< Write Wrap Burst Error Address due to Early Termination, offset: 0x784 */
  __I  uint32_t AHB_WW_ERR_ADDR_ARL;               /**< Write Wrap Burst Error Address due to Arbitration Lock, offset: 0x788 */
  __I  uint32_t AHB_WW_ERR_ADDR;                   /**< AHB Write Wrap Burst Error Address, offset: 0x78C */
  __IO uint32_t FR2;                               /**< Flag 2, offset: 0x790 */
  __IO uint32_t RSER2;                             /**< Interrupt and DMA Request Enable 2, offset: 0x794 */
  uint8_t RESERVED_16[64];
  __I  uint32_t ARSWRST_ADDR;                      /**< AHB Read Burst Address on Soft Reset, offset: 0x7D8 */
  __I  uint32_t ARSWRST_MID;                       /**< AHB Read Burst Initiator ID on Soft Reset, offset: 0x7DC */
  __I  uint32_t AWSWRST_ADDR;                      /**< AHB Write Burst Address on Soft Reset, offset: 0x7E0 */
  uint8_t RESERVED_17[28];
  __IO uint32_t FRAD0_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x800 */
  __IO uint32_t FRAD0_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x804 */
  __IO uint32_t FRAD0_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x808 */
  __IO uint32_t FRAD0_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x80C */
  __I  uint32_t FRAD0_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x810 */
  __I  uint32_t FRAD0_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x814 */
  uint8_t RESERVED_18[8];
  __IO uint32_t FRAD1_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x820 */
  __IO uint32_t FRAD1_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x824 */
  __IO uint32_t FRAD1_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x828 */
  __IO uint32_t FRAD1_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x82C */
  __I  uint32_t FRAD1_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x830 */
  __I  uint32_t FRAD1_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x834 */
  uint8_t RESERVED_19[8];
  __IO uint32_t FRAD2_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x840 */
  __IO uint32_t FRAD2_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x844 */
  __IO uint32_t FRAD2_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x848 */
  __IO uint32_t FRAD2_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x84C */
  __I  uint32_t FRAD2_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x850 */
  __I  uint32_t FRAD2_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x854 */
  uint8_t RESERVED_20[8];
  __IO uint32_t FRAD3_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x860 */
  __IO uint32_t FRAD3_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x864 */
  __IO uint32_t FRAD3_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x868 */
  __IO uint32_t FRAD3_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x86C */
  __I  uint32_t FRAD3_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x870 */
  __I  uint32_t FRAD3_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x874 */
  uint8_t RESERVED_21[8];
  __IO uint32_t FRAD4_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x880 */
  __IO uint32_t FRAD4_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x884 */
  __IO uint32_t FRAD4_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x888 */
  __IO uint32_t FRAD4_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x88C */
  __I  uint32_t FRAD4_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x890 */
  __I  uint32_t FRAD4_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x894 */
  uint8_t RESERVED_22[8];
  __IO uint32_t FRAD5_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x8A0 */
  __IO uint32_t FRAD5_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x8A4 */
  __IO uint32_t FRAD5_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x8A8 */
  __IO uint32_t FRAD5_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x8AC */
  __I  uint32_t FRAD5_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x8B0 */
  __I  uint32_t FRAD5_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x8B4 */
  uint8_t RESERVED_23[8];
  __IO uint32_t FRAD6_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x8C0 */
  __IO uint32_t FRAD6_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x8C4 */
  __IO uint32_t FRAD6_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x8C8 */
  __IO uint32_t FRAD6_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x8CC */
  __I  uint32_t FRAD6_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x8D0 */
  __I  uint32_t FRAD6_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x8D4 */
  uint8_t RESERVED_24[8];
  __IO uint32_t FRAD7_WORD0;                       /**< Flash Region Word 0 - Start Address, offset: 0x8E0 */
  __IO uint32_t FRAD7_WORD1;                       /**< Flash Region Word 1 - End Address, offset: 0x8E4 */
  __IO uint32_t FRAD7_WORD2;                       /**< Flash Region Word 2 - Privileges, offset: 0x8E8 */
  __IO uint32_t FRAD7_WORD3;                       /**< Flash Region Word 3 - Lock Control, offset: 0x8EC */
  __I  uint32_t FRAD7_WORD4;                       /**< Flash Region Word 4 - Compare Address Status, offset: 0x8F0 */
  __I  uint32_t FRAD7_WORD5;                       /**< Flash Region Word 5 - Compare Status Data, offset: 0x8F4 */
  uint8_t RESERVED_25[4];
  __IO uint32_t SFP_ARB_TIMEOUT;                   /**< SFP Arbitration Lock Timeout Counter, offset: 0x8FC */
  __IO uint32_t TG0MDAD;                           /**< Target Group Initiator Domain Access Descriptor, offset: 0x900 */
  __I  uint32_t TGSFAR;                            /**< Target Group SFAR Address, offset: 0x904 */
  __IO uint32_t TGSFARS;                           /**< Target Group SFAR Status, offset: 0x908 */
  __IO uint32_t TGIPCRS;                           /**< Target Group IP Configuration Status, offset: 0x90C */
  __IO uint32_t TG1MDAD;                           /**< Target Group Initiator Domain Access Descriptor, offset: 0x910 */
  uint8_t RESERVED_26[12];
  __IO uint32_t MGC;                               /**< Initiator Global Configuration, offset: 0x920 */
  __IO uint32_t MRC;                               /**< Initiator Read Command, offset: 0x924 */
  __IO uint32_t MTO;                               /**< Initiator Timeout, offset: 0x928 */
  __I  uint32_t FLSEQREQ;                          /**< Flash Sequence Request, offset: 0x92C */
  __I  uint32_t FSMSTAT;                           /**< FSM Status, offset: 0x930 */
  __IO uint32_t IPSERROR;                          /**< IPS Error, offset: 0x934 */
  __IO uint32_t ERRSTAT;                           /**< Error Status, offset: 0x938 */
  __IO uint32_t INT_EN;                            /**< Interrupt Enable, offset: 0x93C */
  uint8_t RESERVED_27[24];
  __IO uint32_t SFP_TG_IPCR;                       /**< IP Configuration, offset: 0x958 */
  __IO uint32_t SFP_TG_SFAR;                       /**< Serial Flash Memory Address, offset: 0x95C */
  __IO uint32_t SFP_LUT_EN[XSPI_SFP_LUT_EN_ARRAY_COUNT]; /**< LUT Access Enable, array offset: 0x960, array step: 0x4 */
  uint8_t RESERVED_28[276];
  __I  uint32_t SFP_LOCK_ERR_ADDR;                 /**< SFP Lock Error Address, offset: 0xA7C */
  struct XSPI_SUB_REG_MDAM_ARRAY {                 /* offset: 0xA80, array step: 0x14 */
    __IO uint32_t SFP_TG_SUB_IPCR;                   /**< IP Configuration, array offset: 0xA80, array step: 0x14 */
    __IO uint32_t SFP_TG_SUB_SFAR;                   /**< Serial Flash Memory Address, array offset: 0xA84, array step: 0x14 */
    __I  uint32_t TGSFAR_SUB;                        /**< Target Group SFAR Address, array offset: 0xA88, array step: 0x14 */
    __IO uint32_t TGSFARS_SUB;                       /**< Target Group SFAR Status, array offset: 0xA8C, array step: 0x14 */
    __IO uint32_t TGIPCRS_SUB;                       /**< Target Group n IP Configuration Status, array offset: 0xA90, array step: 0x14 */
  } SUB_REG_MDAM_ARRAY[XSPI_SUB_REG_MDAM_ARRAY_COUNT];
} XSPI_Type, *XSPI_MemMapPtr;

/** Number of instances of the XSPI module. */
#define XSPI_INSTANCE_COUNT                      (1u)

/* XSPI - Peripheral instance base addresses */
/** Peripheral XSPI base address */
#define IP_XSPI_BASE                             (0x40BA4000u)
/** Peripheral XSPI base pointer */
#define IP_XSPI                                  ((XSPI_Type *)IP_XSPI_BASE)
/** Array initializer of XSPI peripheral base addresses */
#define IP_XSPI_BASE_ADDRS                       { IP_XSPI_BASE }
/** Array initializer of XSPI peripheral base pointers */
#define IP_XSPI_BASE_PTRS                        { IP_XSPI }

/* ----------------------------------------------------------------------------
   -- XSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XSPI_Register_Masks XSPI Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define XSPI_MCR_SWRSTSD_MASK                    (0x1U)
#define XSPI_MCR_SWRSTSD_SHIFT                   (0U)
#define XSPI_MCR_SWRSTSD_WIDTH                   (1U)
#define XSPI_MCR_SWRSTSD(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_SWRSTSD_SHIFT)) & XSPI_MCR_SWRSTSD_MASK)

#define XSPI_MCR_SWRSTHD_MASK                    (0x2U)
#define XSPI_MCR_SWRSTHD_SHIFT                   (1U)
#define XSPI_MCR_SWRSTHD_WIDTH                   (1U)
#define XSPI_MCR_SWRSTHD(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_SWRSTHD_SHIFT)) & XSPI_MCR_SWRSTHD_MASK)

#define XSPI_MCR_DQS_OUT_EN_MASK                 (0x10U)
#define XSPI_MCR_DQS_OUT_EN_SHIFT                (4U)
#define XSPI_MCR_DQS_OUT_EN_WIDTH                (1U)
#define XSPI_MCR_DQS_OUT_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_OUT_EN_SHIFT)) & XSPI_MCR_DQS_OUT_EN_MASK)

