zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_MCR_DQS_EN_MASK                     (0x40U)
#define XSPI_MCR_DQS_EN_SHIFT                    (6U)
#define XSPI_MCR_DQS_EN_WIDTH                    (1U)
#define XSPI_MCR_DQS_EN(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_EN_SHIFT)) & XSPI_MCR_DQS_EN_MASK)

#define XSPI_MCR_DDR_EN_MASK                     (0x80U)
#define XSPI_MCR_DDR_EN_SHIFT                    (7U)
#define XSPI_MCR_DDR_EN_WIDTH                    (1U)
#define XSPI_MCR_DDR_EN(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DDR_EN_SHIFT)) & XSPI_MCR_DDR_EN_MASK)

#define XSPI_MCR_VAR_LAT_EN_MASK                 (0x100U)
#define XSPI_MCR_VAR_LAT_EN_SHIFT                (8U)
#define XSPI_MCR_VAR_LAT_EN_WIDTH                (1U)
#define XSPI_MCR_VAR_LAT_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_VAR_LAT_EN_SHIFT)) & XSPI_MCR_VAR_LAT_EN_MASK)

#define XSPI_MCR_IPS_TG_RST_MASK                 (0x200U)
#define XSPI_MCR_IPS_TG_RST_SHIFT                (9U)
#define XSPI_MCR_IPS_TG_RST_WIDTH                (1U)
#define XSPI_MCR_IPS_TG_RST(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_IPS_TG_RST_SHIFT)) & XSPI_MCR_IPS_TG_RST_MASK)

#define XSPI_MCR_CLR_RXF_MASK                    (0x400U)
#define XSPI_MCR_CLR_RXF_SHIFT                   (10U)
#define XSPI_MCR_CLR_RXF_WIDTH                   (1U)
#define XSPI_MCR_CLR_RXF(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CLR_RXF_SHIFT)) & XSPI_MCR_CLR_RXF_MASK)

#define XSPI_MCR_CLR_TXF_MASK                    (0x800U)
#define XSPI_MCR_CLR_TXF_SHIFT                   (11U)
#define XSPI_MCR_CLR_TXF_WIDTH                   (1U)
#define XSPI_MCR_CLR_TXF(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CLR_TXF_SHIFT)) & XSPI_MCR_CLR_TXF_MASK)

#define XSPI_MCR_DLPEN_MASK                      (0x1000U)
#define XSPI_MCR_DLPEN_SHIFT                     (12U)
#define XSPI_MCR_DLPEN_WIDTH                     (1U)
#define XSPI_MCR_DLPEN(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DLPEN_SHIFT)) & XSPI_MCR_DLPEN_MASK)

#define XSPI_MCR_MDIS_MASK                       (0x4000U)
#define XSPI_MCR_MDIS_SHIFT                      (14U)
#define XSPI_MCR_MDIS_WIDTH                      (1U)
#define XSPI_MCR_MDIS(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_MDIS_SHIFT)) & XSPI_MCR_MDIS_MASK)

#define XSPI_MCR_ISD2FA_MASK                     (0x10000U)
#define XSPI_MCR_ISD2FA_SHIFT                    (16U)
#define XSPI_MCR_ISD2FA_WIDTH                    (1U)
#define XSPI_MCR_ISD2FA(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_ISD2FA_SHIFT)) & XSPI_MCR_ISD2FA_MASK)

#define XSPI_MCR_ISD3FA_MASK                     (0x20000U)
#define XSPI_MCR_ISD3FA_SHIFT                    (17U)
#define XSPI_MCR_ISD3FA_WIDTH                    (1U)
#define XSPI_MCR_ISD3FA(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_ISD3FA_SHIFT)) & XSPI_MCR_ISD3FA_MASK)

#define XSPI_MCR_DQS_FA_SEL_MASK                 (0x3000000U)
#define XSPI_MCR_DQS_FA_SEL_SHIFT                (24U)
#define XSPI_MCR_DQS_FA_SEL_WIDTH                (2U)
#define XSPI_MCR_DQS_FA_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_FA_SEL_SHIFT)) & XSPI_MCR_DQS_FA_SEL_MASK)

#define XSPI_MCR_CKN_FA_EN_MASK                  (0x4000000U)
#define XSPI_MCR_CKN_FA_EN_SHIFT                 (26U)
#define XSPI_MCR_CKN_FA_EN_WIDTH                 (1U)
#define XSPI_MCR_CKN_FA_EN(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CKN_FA_EN_SHIFT)) & XSPI_MCR_CKN_FA_EN_MASK)
/*! @} */

/*! @name IPCR - IP Configuration */
/*! @{ */

#define XSPI_IPCR_IDATSZ_MASK                    (0xFFFFU)
#define XSPI_IPCR_IDATSZ_SHIFT                   (0U)
#define XSPI_IPCR_IDATSZ_WIDTH                   (16U)
#define XSPI_IPCR_IDATSZ(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_IPCR_IDATSZ_SHIFT)) & XSPI_IPCR_IDATSZ_MASK)

#define XSPI_IPCR_SEQID_MASK                     (0xF000000U)
#define XSPI_IPCR_SEQID_SHIFT                    (24U)
#define XSPI_IPCR_SEQID_WIDTH                    (4U)
#define XSPI_IPCR_SEQID(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_IPCR_SEQID_SHIFT)) & XSPI_IPCR_SEQID_MASK)
/*! @} */

/*! @name FLSHCR - Flash Memory Configuration */
/*! @{ */

#define XSPI_FLSHCR_TCSS_MASK                    (0xFU)
#define XSPI_FLSHCR_TCSS_SHIFT                   (0U)
#define XSPI_FLSHCR_TCSS_WIDTH                   (4U)
#define XSPI_FLSHCR_TCSS(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TCSS_SHIFT)) & XSPI_FLSHCR_TCSS_MASK)

#define XSPI_FLSHCR_TCSH_MASK                    (0xF00U)
#define XSPI_FLSHCR_TCSH_SHIFT                   (8U)
#define XSPI_FLSHCR_TCSH_WIDTH                   (4U)
#define XSPI_FLSHCR_TCSH(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TCSH_SHIFT)) & XSPI_FLSHCR_TCSH_MASK)

#define XSPI_FLSHCR_TDH_MASK                     (0x30000U)
#define XSPI_FLSHCR_TDH_SHIFT                    (16U)
#define XSPI_FLSHCR_TDH_WIDTH                    (2U)
#define XSPI_FLSHCR_TDH(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TDH_SHIFT)) & XSPI_FLSHCR_TDH_MASK)
/*! @} */

/*! @name BUF0CR - Buffer Configuration */
/*! @{ */

#define XSPI_BUF0CR_MSTRID_MASK                  (0x3FU)
#define XSPI_BUF0CR_MSTRID_SHIFT                 (0U)
#define XSPI_BUF0CR_MSTRID_WIDTH                 (6U)
#define XSPI_BUF0CR_MSTRID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_MSTRID_SHIFT)) & XSPI_BUF0CR_MSTRID_MASK)

#define XSPI_BUF0CR_ADATSZ_MASK                  (0x3FF00U)
#define XSPI_BUF0CR_ADATSZ_SHIFT                 (8U)
#define XSPI_BUF0CR_ADATSZ_WIDTH                 (10U)
#define XSPI_BUF0CR_ADATSZ(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_ADATSZ_SHIFT)) & XSPI_BUF0CR_ADATSZ_MASK)

#define XSPI_BUF0CR_SUBBUF0_DIV_MASK             (0xE00000U)
#define XSPI_BUF0CR_SUBBUF0_DIV_SHIFT            (21U)
#define XSPI_BUF0CR_SUBBUF0_DIV_WIDTH            (3U)
#define XSPI_BUF0CR_SUBBUF0_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_SUBBUF0_DIV_SHIFT)) & XSPI_BUF0CR_SUBBUF0_DIV_MASK)

#define XSPI_BUF0CR_SUBBUF1_DIV_MASK             (0x7000000U)
#define XSPI_BUF0CR_SUBBUF1_DIV_SHIFT            (24U)
#define XSPI_BUF0CR_SUBBUF1_DIV_WIDTH            (3U)
#define XSPI_BUF0CR_SUBBUF1_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_SUBBUF1_DIV_SHIFT)) & XSPI_BUF0CR_SUBBUF1_DIV_MASK)

#define XSPI_BUF0CR_SUBBUF2_DIV_MASK             (0x38000000U)
#define XSPI_BUF0CR_SUBBUF2_DIV_SHIFT            (27U)
#define XSPI_BUF0CR_SUBBUF2_DIV_WIDTH            (3U)
#define XSPI_BUF0CR_SUBBUF2_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_SUBBUF2_DIV_SHIFT)) & XSPI_BUF0CR_SUBBUF2_DIV_MASK)

