zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_BUF0CR_SUB_DIV_EN_MASK              (0x40000000U)
#define XSPI_BUF0CR_SUB_DIV_EN_SHIFT             (30U)
#define XSPI_BUF0CR_SUB_DIV_EN_WIDTH             (1U)
#define XSPI_BUF0CR_SUB_DIV_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_SUB_DIV_EN_SHIFT)) & XSPI_BUF0CR_SUB_DIV_EN_MASK)

#define XSPI_BUF0CR_HP_EN_MASK                   (0x80000000U)
#define XSPI_BUF0CR_HP_EN_SHIFT                  (31U)
#define XSPI_BUF0CR_HP_EN_WIDTH                  (1U)
#define XSPI_BUF0CR_HP_EN(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_BUF0CR_HP_EN_SHIFT)) & XSPI_BUF0CR_HP_EN_MASK)
/*! @} */

/*! @name BUF1CR - Buffer Configuration */
/*! @{ */

#define XSPI_BUF1CR_MSTRID_MASK                  (0x3FU)
#define XSPI_BUF1CR_MSTRID_SHIFT                 (0U)
#define XSPI_BUF1CR_MSTRID_WIDTH                 (6U)
#define XSPI_BUF1CR_MSTRID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_MSTRID_SHIFT)) & XSPI_BUF1CR_MSTRID_MASK)

#define XSPI_BUF1CR_ADATSZ_MASK                  (0x3FF00U)
#define XSPI_BUF1CR_ADATSZ_SHIFT                 (8U)
#define XSPI_BUF1CR_ADATSZ_WIDTH                 (10U)
#define XSPI_BUF1CR_ADATSZ(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_ADATSZ_SHIFT)) & XSPI_BUF1CR_ADATSZ_MASK)

#define XSPI_BUF1CR_SUBBUF0_DIV_MASK             (0xE00000U)
#define XSPI_BUF1CR_SUBBUF0_DIV_SHIFT            (21U)
#define XSPI_BUF1CR_SUBBUF0_DIV_WIDTH            (3U)
#define XSPI_BUF1CR_SUBBUF0_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_SUBBUF0_DIV_SHIFT)) & XSPI_BUF1CR_SUBBUF0_DIV_MASK)

#define XSPI_BUF1CR_SUBBUF1_DIV_MASK             (0x7000000U)
#define XSPI_BUF1CR_SUBBUF1_DIV_SHIFT            (24U)
#define XSPI_BUF1CR_SUBBUF1_DIV_WIDTH            (3U)
#define XSPI_BUF1CR_SUBBUF1_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_SUBBUF1_DIV_SHIFT)) & XSPI_BUF1CR_SUBBUF1_DIV_MASK)

#define XSPI_BUF1CR_SUBBUF2_DIV_MASK             (0x38000000U)
#define XSPI_BUF1CR_SUBBUF2_DIV_SHIFT            (27U)
#define XSPI_BUF1CR_SUBBUF2_DIV_WIDTH            (3U)
#define XSPI_BUF1CR_SUBBUF2_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_SUBBUF2_DIV_SHIFT)) & XSPI_BUF1CR_SUBBUF2_DIV_MASK)

#define XSPI_BUF1CR_SUB_DIV_EN_MASK              (0x40000000U)
#define XSPI_BUF1CR_SUB_DIV_EN_SHIFT             (30U)
#define XSPI_BUF1CR_SUB_DIV_EN_WIDTH             (1U)
#define XSPI_BUF1CR_SUB_DIV_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_SUB_DIV_EN_SHIFT)) & XSPI_BUF1CR_SUB_DIV_EN_MASK)

#define XSPI_BUF1CR_HP_EN_MASK                   (0x80000000U)
#define XSPI_BUF1CR_HP_EN_SHIFT                  (31U)
#define XSPI_BUF1CR_HP_EN_WIDTH                  (1U)
#define XSPI_BUF1CR_HP_EN(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_BUF1CR_HP_EN_SHIFT)) & XSPI_BUF1CR_HP_EN_MASK)
/*! @} */

/*! @name BUF2CR - Buffer Configuration */
/*! @{ */

#define XSPI_BUF2CR_MSTRID_MASK                  (0x3FU)
#define XSPI_BUF2CR_MSTRID_SHIFT                 (0U)
#define XSPI_BUF2CR_MSTRID_WIDTH                 (6U)
#define XSPI_BUF2CR_MSTRID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_MSTRID_SHIFT)) & XSPI_BUF2CR_MSTRID_MASK)

#define XSPI_BUF2CR_ADATSZ_MASK                  (0x3FF00U)
#define XSPI_BUF2CR_ADATSZ_SHIFT                 (8U)
#define XSPI_BUF2CR_ADATSZ_WIDTH                 (10U)
#define XSPI_BUF2CR_ADATSZ(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_ADATSZ_SHIFT)) & XSPI_BUF2CR_ADATSZ_MASK)

#define XSPI_BUF2CR_SUBBUF0_DIV_MASK             (0xE00000U)
#define XSPI_BUF2CR_SUBBUF0_DIV_SHIFT            (21U)
#define XSPI_BUF2CR_SUBBUF0_DIV_WIDTH            (3U)
#define XSPI_BUF2CR_SUBBUF0_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_SUBBUF0_DIV_SHIFT)) & XSPI_BUF2CR_SUBBUF0_DIV_MASK)

#define XSPI_BUF2CR_SUBBUF1_DIV_MASK             (0x7000000U)
#define XSPI_BUF2CR_SUBBUF1_DIV_SHIFT            (24U)
#define XSPI_BUF2CR_SUBBUF1_DIV_WIDTH            (3U)
#define XSPI_BUF2CR_SUBBUF1_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_SUBBUF1_DIV_SHIFT)) & XSPI_BUF2CR_SUBBUF1_DIV_MASK)

#define XSPI_BUF2CR_SUBBUF2_DIV_MASK             (0x38000000U)
#define XSPI_BUF2CR_SUBBUF2_DIV_SHIFT            (27U)
#define XSPI_BUF2CR_SUBBUF2_DIV_WIDTH            (3U)
#define XSPI_BUF2CR_SUBBUF2_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_SUBBUF2_DIV_SHIFT)) & XSPI_BUF2CR_SUBBUF2_DIV_MASK)

#define XSPI_BUF2CR_SUB_DIV_EN_MASK              (0x40000000U)
#define XSPI_BUF2CR_SUB_DIV_EN_SHIFT             (30U)
#define XSPI_BUF2CR_SUB_DIV_EN_WIDTH             (1U)
#define XSPI_BUF2CR_SUB_DIV_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUF2CR_SUB_DIV_EN_SHIFT)) & XSPI_BUF2CR_SUB_DIV_EN_MASK)
/*! @} */

/*! @name BUF3CR - Buffer Configuration */
/*! @{ */

#define XSPI_BUF3CR_MSTRID_MASK                  (0x3FU)
#define XSPI_BUF3CR_MSTRID_SHIFT                 (0U)
#define XSPI_BUF3CR_MSTRID_WIDTH                 (6U)
#define XSPI_BUF3CR_MSTRID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_MSTRID_SHIFT)) & XSPI_BUF3CR_MSTRID_MASK)

#define XSPI_BUF3CR_ADATSZ_MASK                  (0x3FF00U)
#define XSPI_BUF3CR_ADATSZ_SHIFT                 (8U)
#define XSPI_BUF3CR_ADATSZ_WIDTH                 (10U)
#define XSPI_BUF3CR_ADATSZ(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_ADATSZ_SHIFT)) & XSPI_BUF3CR_ADATSZ_MASK)

#define XSPI_BUF3CR_SUBBUF0_DIV_MASK             (0xE00000U)
#define XSPI_BUF3CR_SUBBUF0_DIV_SHIFT            (21U)
#define XSPI_BUF3CR_SUBBUF0_DIV_WIDTH            (3U)
#define XSPI_BUF3CR_SUBBUF0_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_SUBBUF0_DIV_SHIFT)) & XSPI_BUF3CR_SUBBUF0_DIV_MASK)

#define XSPI_BUF3CR_SUBBUF1_DIV_MASK             (0x7000000U)
#define XSPI_BUF3CR_SUBBUF1_DIV_SHIFT            (24U)
#define XSPI_BUF3CR_SUBBUF1_DIV_WIDTH            (3U)
#define XSPI_BUF3CR_SUBBUF1_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_SUBBUF1_DIV_SHIFT)) & XSPI_BUF3CR_SUBBUF1_DIV_MASK)

#define XSPI_BUF3CR_SUBBUF2_DIV_MASK             (0x38000000U)
#define XSPI_BUF3CR_SUBBUF2_DIV_SHIFT            (27U)
#define XSPI_BUF3CR_SUBBUF2_DIV_WIDTH            (3U)
#define XSPI_BUF3CR_SUBBUF2_DIV(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_SUBBUF2_DIV_SHIFT)) & XSPI_BUF3CR_SUBBUF2_DIV_MASK)

#define XSPI_BUF3CR_SUB_DIV_EN_MASK              (0x40000000U)
#define XSPI_BUF3CR_SUB_DIV_EN_SHIFT             (30U)
#define XSPI_BUF3CR_SUB_DIV_EN_WIDTH             (1U)
#define XSPI_BUF3CR_SUB_DIV_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_SUB_DIV_EN_SHIFT)) & XSPI_BUF3CR_SUB_DIV_EN_MASK)

#define XSPI_BUF3CR_ALLMST_MASK                  (0x80000000U)
#define XSPI_BUF3CR_ALLMST_SHIFT                 (31U)
#define XSPI_BUF3CR_ALLMST_WIDTH                 (1U)
#define XSPI_BUF3CR_ALLMST(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUF3CR_ALLMST_SHIFT)) & XSPI_BUF3CR_ALLMST_MASK)
/*! @} */

/*! @name BFGENCR - Buffer Generic Configuration */
/*! @{ */

