zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_BFGENCR_SEQID_RDSR_MASK             (0xFU)
#define XSPI_BFGENCR_SEQID_RDSR_SHIFT            (0U)
#define XSPI_BFGENCR_SEQID_RDSR_WIDTH            (4U)
#define XSPI_BFGENCR_SEQID_RDSR(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_RDSR_SHIFT)) & XSPI_BFGENCR_SEQID_RDSR_MASK)

#define XSPI_BFGENCR_WRTER_EN_MASK               (0x10U)
#define XSPI_BFGENCR_WRTER_EN_SHIFT              (4U)
#define XSPI_BFGENCR_WRTER_EN_WIDTH              (1U)
#define XSPI_BFGENCR_WRTER_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_WRTER_EN_SHIFT)) & XSPI_BFGENCR_WRTER_EN_MASK)

#define XSPI_BFGENCR_SPLITEN_MASK                (0x100U)
#define XSPI_BFGENCR_SPLITEN_SHIFT               (8U)
#define XSPI_BFGENCR_SPLITEN_WIDTH               (1U)
#define XSPI_BFGENCR_SPLITEN(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SPLITEN_SHIFT)) & XSPI_BFGENCR_SPLITEN_MASK)

#define XSPI_BFGENCR_AHBSSIZE_MASK               (0x600U)
#define XSPI_BFGENCR_AHBSSIZE_SHIFT              (9U)
#define XSPI_BFGENCR_AHBSSIZE_WIDTH              (2U)
#define XSPI_BFGENCR_AHBSSIZE(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_AHBSSIZE_SHIFT)) & XSPI_BFGENCR_AHBSSIZE_MASK)

#define XSPI_BFGENCR_FLSHINTP_MASK               (0x800U)
#define XSPI_BFGENCR_FLSHINTP_SHIFT              (11U)
#define XSPI_BFGENCR_FLSHINTP_WIDTH              (1U)
#define XSPI_BFGENCR_FLSHINTP(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_FLSHINTP_SHIFT)) & XSPI_BFGENCR_FLSHINTP_MASK)

#define XSPI_BFGENCR_SEQID_MASK                  (0xF000U)
#define XSPI_BFGENCR_SEQID_SHIFT                 (12U)
#define XSPI_BFGENCR_SEQID_WIDTH                 (4U)
#define XSPI_BFGENCR_SEQID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_SHIFT)) & XSPI_BFGENCR_SEQID_MASK)

#define XSPI_BFGENCR_SEQID_WR_EN_MASK            (0x20000U)
#define XSPI_BFGENCR_SEQID_WR_EN_SHIFT           (17U)
#define XSPI_BFGENCR_SEQID_WR_EN_WIDTH           (1U)
#define XSPI_BFGENCR_SEQID_WR_EN(x)              (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_WR_EN_SHIFT)) & XSPI_BFGENCR_SEQID_WR_EN_MASK)

#define XSPI_BFGENCR_PPWF_CLR_MASK               (0x100000U)
#define XSPI_BFGENCR_PPWF_CLR_SHIFT              (20U)
#define XSPI_BFGENCR_PPWF_CLR_WIDTH              (1U)
#define XSPI_BFGENCR_PPWF_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_PPWF_CLR_SHIFT)) & XSPI_BFGENCR_PPWF_CLR_MASK)

#define XSPI_BFGENCR_WR_FLUSH_EN_MASK            (0x200000U)
#define XSPI_BFGENCR_WR_FLUSH_EN_SHIFT           (21U)
#define XSPI_BFGENCR_WR_FLUSH_EN_WIDTH           (1U)
#define XSPI_BFGENCR_WR_FLUSH_EN(x)              (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_WR_FLUSH_EN_SHIFT)) & XSPI_BFGENCR_WR_FLUSH_EN_MASK)

#define XSPI_BFGENCR_ALIGN_MASK                  (0x1C00000U)
#define XSPI_BFGENCR_ALIGN_SHIFT                 (22U)
#define XSPI_BFGENCR_ALIGN_WIDTH                 (3U)
#define XSPI_BFGENCR_ALIGN(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_ALIGN_SHIFT)) & XSPI_BFGENCR_ALIGN_MASK)

#define XSPI_BFGENCR_SEQID_WR_MASK               (0xF0000000U)
#define XSPI_BFGENCR_SEQID_WR_SHIFT              (28U)
#define XSPI_BFGENCR_SEQID_WR_WIDTH              (4U)
#define XSPI_BFGENCR_SEQID_WR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_WR_SHIFT)) & XSPI_BFGENCR_SEQID_WR_MASK)
/*! @} */

/*! @name SOCCR - SOC Configuration */
/*! @{ */

#define XSPI_SOCCR_SOCCFG_MASK                   (0xFFFFFFU)
#define XSPI_SOCCR_SOCCFG_SHIFT                  (0U)
#define XSPI_SOCCR_SOCCFG_WIDTH                  (24U)
#define XSPI_SOCCR_SOCCFG(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_SOCCR_SOCCFG_SHIFT)) & XSPI_SOCCR_SOCCFG_MASK)

#define XSPI_SOCCR_MASK_ECC_MASK                 (0x2000000U)
#define XSPI_SOCCR_MASK_ECC_SHIFT                (25U)
#define XSPI_SOCCR_MASK_ECC_WIDTH                (1U)
#define XSPI_SOCCR_MASK_ECC(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SOCCR_MASK_ECC_SHIFT)) & XSPI_SOCCR_MASK_ECC_MASK)

#define XSPI_SOCCR_OBE_MASK_EN_MASK              (0x4000000U)
#define XSPI_SOCCR_OBE_MASK_EN_SHIFT             (26U)
#define XSPI_SOCCR_OBE_MASK_EN_WIDTH             (1U)
#define XSPI_SOCCR_OBE_MASK_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_SOCCR_OBE_MASK_EN_SHIFT)) & XSPI_SOCCR_OBE_MASK_EN_MASK)

#define XSPI_SOCCR_HRESP_ERR_MASK_MASK           (0x8000000U)
#define XSPI_SOCCR_HRESP_ERR_MASK_SHIFT          (27U)
#define XSPI_SOCCR_HRESP_ERR_MASK_WIDTH          (1U)
#define XSPI_SOCCR_HRESP_ERR_MASK(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_SOCCR_HRESP_ERR_MASK_SHIFT)) & XSPI_SOCCR_HRESP_ERR_MASK_MASK)

#define XSPI_SOCCR_ENA_DLLABRT_MASK              (0x10000000U)
#define XSPI_SOCCR_ENA_DLLABRT_SHIFT             (28U)
#define XSPI_SOCCR_ENA_DLLABRT_WIDTH             (1U)
#define XSPI_SOCCR_ENA_DLLABRT(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_SOCCR_ENA_DLLABRT_SHIFT)) & XSPI_SOCCR_ENA_DLLABRT_MASK)
/*! @} */

/*! @name BUFIND - Buffer 0 Top Index..Buffer 2 Top Index */
/*! @{ */

#define XSPI_BUFIND_TPINDX_MASK                  (0x1FF8U)
#define XSPI_BUFIND_TPINDX_SHIFT                 (3U)
#define XSPI_BUFIND_TPINDX_WIDTH                 (10U)
#define XSPI_BUFIND_TPINDX(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BUFIND_TPINDX_SHIFT)) & XSPI_BUFIND_TPINDX_MASK)
/*! @} */

/*! @name PRW_RDSR - Page Read Wait Status */
/*! @{ */

#define XSPI_PRW_RDSR_RDSR_MASK                  (0xFFFFU)
#define XSPI_PRW_RDSR_RDSR_SHIFT                 (0U)
#define XSPI_PRW_RDSR_RDSR_WIDTH                 (16U)
#define XSPI_PRW_RDSR_RDSR(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_RDSR_SHIFT)) & XSPI_PRW_RDSR_RDSR_MASK)

#define XSPI_PRW_RDSR_RDSRWSEL_MASK              (0x200000U)
#define XSPI_PRW_RDSR_RDSRWSEL_SHIFT             (21U)
#define XSPI_PRW_RDSR_RDSRWSEL_WIDTH             (1U)
#define XSPI_PRW_RDSR_RDSRWSEL(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_RDSRWSEL_SHIFT)) & XSPI_PRW_RDSR_RDSRWSEL_MASK)

#define XSPI_PRW_RDSR_RDSRVCHK_MASK              (0x400000U)
#define XSPI_PRW_RDSR_RDSRVCHK_SHIFT             (22U)
#define XSPI_PRW_RDSR_RDSRVCHK_WIDTH             (1U)
#define XSPI_PRW_RDSR_RDSRVCHK(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_RDSRVCHK_SHIFT)) & XSPI_PRW_RDSR_RDSRVCHK_MASK)

#define XSPI_PRW_RDSR_RDSR_HWS_MASK              (0x800000U)
#define XSPI_PRW_RDSR_RDSR_HWS_SHIFT             (23U)
#define XSPI_PRW_RDSR_RDSR_HWS_WIDTH             (1U)
#define XSPI_PRW_RDSR_RDSR_HWS(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_RDSR_HWS_SHIFT)) & XSPI_PRW_RDSR_RDSR_HWS_MASK)

#define XSPI_PRW_RDSR_LOC_MASK                   (0xF000000U)
#define XSPI_PRW_RDSR_LOC_SHIFT                  (24U)
#define XSPI_PRW_RDSR_LOC_WIDTH                  (4U)
#define XSPI_PRW_RDSR_LOC(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_LOC_SHIFT)) & XSPI_PRW_RDSR_LOC_MASK)

#define XSPI_PRW_RDSR_VALID_MASK                 (0x80000000U)
#define XSPI_PRW_RDSR_VALID_SHIFT                (31U)
#define XSPI_PRW_RDSR_VALID_WIDTH                (1U)
#define XSPI_PRW_RDSR_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_PRW_RDSR_VALID_SHIFT)) & XSPI_PRW_RDSR_VALID_MASK)
/*! @} */

