zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
/*! @name AWRCR - AHB Write Configuration */
/*! @{ */

#define XSPI_AWRCR_PPW_RD_DIS_MASK               (0x4000U)
#define XSPI_AWRCR_PPW_RD_DIS_SHIFT              (14U)
#define XSPI_AWRCR_PPW_RD_DIS_WIDTH              (1U)
#define XSPI_AWRCR_PPW_RD_DIS(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_AWRCR_PPW_RD_DIS_SHIFT)) & XSPI_AWRCR_PPW_RD_DIS_MASK)

#define XSPI_AWRCR_PPW_WR_DIS_MASK               (0x8000U)
#define XSPI_AWRCR_PPW_WR_DIS_SHIFT              (15U)
#define XSPI_AWRCR_PPW_WR_DIS_WIDTH              (1U)
#define XSPI_AWRCR_PPW_WR_DIS(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_AWRCR_PPW_WR_DIS_SHIFT)) & XSPI_AWRCR_PPW_WR_DIS_MASK)

#define XSPI_AWRCR_L2WSEQID_MASK                 (0xF00000U)
#define XSPI_AWRCR_L2WSEQID_SHIFT                (20U)
#define XSPI_AWRCR_L2WSEQID_WIDTH                (4U)
#define XSPI_AWRCR_L2WSEQID(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_AWRCR_L2WSEQID_SHIFT)) & XSPI_AWRCR_L2WSEQID_MASK)
/*! @} */

/*! @name ARDCR - AHB Read Configuration */
/*! @{ */

#define XSPI_ARDCR_SNAND_RD_MASK                 (0x3U)
#define XSPI_ARDCR_SNAND_RD_SHIFT                (0U)
#define XSPI_ARDCR_SNAND_RD_WIDTH                (2U)
#define XSPI_ARDCR_SNAND_RD(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_ARDCR_SNAND_RD_SHIFT)) & XSPI_ARDCR_SNAND_RD_MASK)

#define XSPI_ARDCR_SNANDEXT_MASK                 (0x4U)
#define XSPI_ARDCR_SNANDEXT_SHIFT                (2U)
#define XSPI_ARDCR_SNANDEXT_WIDTH                (1U)
#define XSPI_ARDCR_SNANDEXT(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_ARDCR_SNANDEXT_SHIFT)) & XSPI_ARDCR_SNANDEXT_MASK)

#define XSPI_ARDCR_L2_SEQID_MASK                 (0xF0U)
#define XSPI_ARDCR_L2_SEQID_SHIFT                (4U)
#define XSPI_ARDCR_L2_SEQID_WIDTH                (4U)
#define XSPI_ARDCR_L2_SEQID(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_ARDCR_L2_SEQID_SHIFT)) & XSPI_ARDCR_L2_SEQID_MASK)

#define XSPI_ARDCR_RDSR_ID_MASK                  (0xF000U)
#define XSPI_ARDCR_RDSR_ID_SHIFT                 (12U)
#define XSPI_ARDCR_RDSR_ID_WIDTH                 (4U)
#define XSPI_ARDCR_RDSR_ID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_ARDCR_RDSR_ID_SHIFT)) & XSPI_ARDCR_RDSR_ID_MASK)

#define XSPI_ARDCR_SNANDRAS_MASK                 (0x3E0000U)
#define XSPI_ARDCR_SNANDRAS_SHIFT                (17U)
#define XSPI_ARDCR_SNANDRAS_WIDTH                (5U)
#define XSPI_ARDCR_SNANDRAS(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_ARDCR_SNANDRAS_SHIFT)) & XSPI_ARDCR_SNANDRAS_MASK)
/*! @} */

/*! @name AWITO - AHB Write Idle Timeout Configuration */
/*! @{ */

#define XSPI_AWITO_AWITOVAL_MASK                 (0x7FFFFFFFU)
#define XSPI_AWITO_AWITOVAL_SHIFT                (0U)
#define XSPI_AWITO_AWITOVAL_WIDTH                (31U)
#define XSPI_AWITO_AWITOVAL(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_AWITO_AWITOVAL_SHIFT)) & XSPI_AWITO_AWITOVAL_MASK)

#define XSPI_AWITO_AWICNTEN_MASK                 (0x80000000U)
#define XSPI_AWITO_AWICNTEN_SHIFT                (31U)
#define XSPI_AWITO_AWICNTEN_WIDTH                (1U)
#define XSPI_AWITO_AWICNTEN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_AWITO_AWICNTEN_SHIFT)) & XSPI_AWITO_AWICNTEN_MASK)
/*! @} */

/*! @name FSR_ADDR - Flash Status Register Address */
/*! @{ */

#define XSPI_FSR_ADDR_ADDR_MASK                  (0xFFFFU)
#define XSPI_FSR_ADDR_ADDR_SHIFT                 (0U)
#define XSPI_FSR_ADDR_ADDR_WIDTH                 (16U)
#define XSPI_FSR_ADDR_ADDR(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_FSR_ADDR_ADDR_SHIFT)) & XSPI_FSR_ADDR_ADDR_MASK)
/*! @} */

/*! @name DLLCR - DLL Flash Memory A Configuration */
/*! @{ */

#define XSPI_DLLCR_SLV_UPD_MASK                  (0x1U)
#define XSPI_DLLCR_SLV_UPD_SHIFT                 (0U)
#define XSPI_DLLCR_SLV_UPD_WIDTH                 (1U)
#define XSPI_DLLCR_SLV_UPD(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_UPD_SHIFT)) & XSPI_DLLCR_SLV_UPD_MASK)

#define XSPI_DLLCR_SLV_DLL_BYPASS_MASK           (0x2U)
#define XSPI_DLLCR_SLV_DLL_BYPASS_SHIFT          (1U)
#define XSPI_DLLCR_SLV_DLL_BYPASS_WIDTH          (1U)
#define XSPI_DLLCR_SLV_DLL_BYPASS(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_DLL_BYPASS_SHIFT)) & XSPI_DLLCR_SLV_DLL_BYPASS_MASK)

#define XSPI_DLLCR_SLV_EN_MASK                   (0x4U)
#define XSPI_DLLCR_SLV_EN_SHIFT                  (2U)
#define XSPI_DLLCR_SLV_EN_WIDTH                  (1U)
#define XSPI_DLLCR_SLV_EN(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_EN_SHIFT)) & XSPI_DLLCR_SLV_EN_MASK)

#define XSPI_DLLCR_SLAVE_AUTO_UPDT_MASK          (0x8U)
#define XSPI_DLLCR_SLAVE_AUTO_UPDT_SHIFT         (3U)
#define XSPI_DLLCR_SLAVE_AUTO_UPDT_WIDTH         (1U)
#define XSPI_DLLCR_SLAVE_AUTO_UPDT(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLAVE_AUTO_UPDT_SHIFT)) & XSPI_DLLCR_SLAVE_AUTO_UPDT_MASK)

#define XSPI_DLLCR_DLL_CDL8_MASK                 (0x10U)
#define XSPI_DLLCR_DLL_CDL8_SHIFT                (4U)
#define XSPI_DLLCR_DLL_CDL8_WIDTH                (1U)
#define XSPI_DLLCR_DLL_CDL8(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_DLL_CDL8_SHIFT)) & XSPI_DLLCR_DLL_CDL8_MASK)

#define XSPI_DLLCR_SLV_DLY_FINE_MASK             (0xE0U)
#define XSPI_DLLCR_SLV_DLY_FINE_SHIFT            (5U)
#define XSPI_DLLCR_SLV_DLY_FINE_WIDTH            (3U)
#define XSPI_DLLCR_SLV_DLY_FINE(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_DLY_FINE_SHIFT)) & XSPI_DLLCR_SLV_DLY_FINE_MASK)

#define XSPI_DLLCR_SLV_DLY_COARSE_MASK           (0xF00U)
#define XSPI_DLLCR_SLV_DLY_COARSE_SHIFT          (8U)
#define XSPI_DLLCR_SLV_DLY_COARSE_WIDTH          (4U)
#define XSPI_DLLCR_SLV_DLY_COARSE(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_DLY_COARSE_SHIFT)) & XSPI_DLLCR_SLV_DLY_COARSE_MASK)

#define XSPI_DLLCR_SLV_DLY_OFFSET_MASK           (0x7000U)
#define XSPI_DLLCR_SLV_DLY_OFFSET_SHIFT          (12U)
#define XSPI_DLLCR_SLV_DLY_OFFSET_WIDTH          (3U)
#define XSPI_DLLCR_SLV_DLY_OFFSET(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_DLY_OFFSET_SHIFT)) & XSPI_DLLCR_SLV_DLY_OFFSET_MASK)

#define XSPI_DLLCR_SLV_FINE_OFFSET_MASK          (0xF0000U)
#define XSPI_DLLCR_SLV_FINE_OFFSET_SHIFT         (16U)
#define XSPI_DLLCR_SLV_FINE_OFFSET_WIDTH         (4U)
#define XSPI_DLLCR_SLV_FINE_OFFSET(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_SLV_FINE_OFFSET_SHIFT)) & XSPI_DLLCR_SLV_FINE_OFFSET_MASK)

#define XSPI_DLLCR_DLLRES_MASK                   (0xF00000U)
#define XSPI_DLLCR_DLLRES_SHIFT                  (20U)
#define XSPI_DLLCR_DLLRES_WIDTH                  (4U)
#define XSPI_DLLCR_DLLRES(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_DLLRES_SHIFT)) & XSPI_DLLCR_DLLRES_MASK)

#define XSPI_DLLCR_DLL_REFCNTR_MASK              (0xF000000U)
#define XSPI_DLLCR_DLL_REFCNTR_SHIFT             (24U)
#define XSPI_DLLCR_DLL_REFCNTR_WIDTH             (4U)
#define XSPI_DLLCR_DLL_REFCNTR(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_DLL_REFCNTR_SHIFT)) & XSPI_DLLCR_DLL_REFCNTR_MASK)

