zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_DLLCR_FREQEN_MASK                   (0x40000000U)
#define XSPI_DLLCR_FREQEN_SHIFT                  (30U)
#define XSPI_DLLCR_FREQEN_WIDTH                  (1U)
#define XSPI_DLLCR_FREQEN(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_FREQEN_SHIFT)) & XSPI_DLLCR_FREQEN_MASK)

#define XSPI_DLLCR_DLLEN_MASK                    (0x80000000U)
#define XSPI_DLLCR_DLLEN_SHIFT                   (31U)
#define XSPI_DLLCR_DLLEN_WIDTH                   (1U)
#define XSPI_DLLCR_DLLEN(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_DLLCR_DLLEN_SHIFT)) & XSPI_DLLCR_DLLEN_MASK)
/*! @} */

/*! @name PARITYCR - Parity Configuration */
/*! @{ */

#define XSPI_PARITYCR_CRCBIN_FA_MASK             (0x20U)
#define XSPI_PARITYCR_CRCBIN_FA_SHIFT            (5U)
#define XSPI_PARITYCR_CRCBIN_FA_WIDTH            (1U)
#define XSPI_PARITYCR_CRCBIN_FA(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_CRCBIN_FA_SHIFT)) & XSPI_PARITYCR_CRCBIN_FA_MASK)

#define XSPI_PARITYCR_CRCBEN_FA_MASK             (0x40U)
#define XSPI_PARITYCR_CRCBEN_FA_SHIFT            (6U)
#define XSPI_PARITYCR_CRCBEN_FA_WIDTH            (1U)
#define XSPI_PARITYCR_CRCBEN_FA(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_CRCBEN_FA_SHIFT)) & XSPI_PARITYCR_CRCBEN_FA_MASK)

#define XSPI_PARITYCR_CRCEN_FA_MASK              (0x80U)
#define XSPI_PARITYCR_CRCEN_FA_SHIFT             (7U)
#define XSPI_PARITYCR_CRCEN_FA_WIDTH             (1U)
#define XSPI_PARITYCR_CRCEN_FA(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_CRCEN_FA_SHIFT)) & XSPI_PARITYCR_CRCEN_FA_MASK)

#define XSPI_PARITYCR_BYTE_SIZE_FA_MASK          (0x100U)
#define XSPI_PARITYCR_BYTE_SIZE_FA_SHIFT         (8U)
#define XSPI_PARITYCR_BYTE_SIZE_FA_WIDTH         (1U)
#define XSPI_PARITYCR_BYTE_SIZE_FA(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_BYTE_SIZE_FA_SHIFT)) & XSPI_PARITYCR_BYTE_SIZE_FA_MASK)

#define XSPI_PARITYCR_CHUNKSIZE_FA_MASK          (0x7E00U)
#define XSPI_PARITYCR_CHUNKSIZE_FA_SHIFT         (9U)
#define XSPI_PARITYCR_CHUNKSIZE_FA_WIDTH         (6U)
#define XSPI_PARITYCR_CHUNKSIZE_FA(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_CHUNKSIZE_FA_SHIFT)) & XSPI_PARITYCR_CHUNKSIZE_FA_MASK)

#define XSPI_PARITYCR_CRC_WNDW_FA_MASK           (0x8000U)
#define XSPI_PARITYCR_CRC_WNDW_FA_SHIFT          (15U)
#define XSPI_PARITYCR_CRC_WNDW_FA_WIDTH          (1U)
#define XSPI_PARITYCR_CRC_WNDW_FA(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_PARITYCR_CRC_WNDW_FA_SHIFT)) & XSPI_PARITYCR_CRC_WNDW_FA_MASK)
/*! @} */

/*! @name SFAR - Serial Flash Memory Address */
/*! @{ */

#define XSPI_SFAR_SFADR_MASK                     (0xFFFFFFFFU)
#define XSPI_SFAR_SFADR_SHIFT                    (0U)
#define XSPI_SFAR_SFADR_WIDTH                    (32U)
#define XSPI_SFAR_SFADR(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_SFAR_SFADR_SHIFT)) & XSPI_SFAR_SFADR_MASK)
/*! @} */

/*! @name SFACR - Serial Flash Memory Address Configuration */
/*! @{ */

#define XSPI_SFACR_CAS_MASK                      (0xFU)
#define XSPI_SFACR_CAS_SHIFT                     (0U)
#define XSPI_SFACR_CAS_WIDTH                     (4U)
#define XSPI_SFACR_CAS(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_CAS_SHIFT)) & XSPI_SFACR_CAS_MASK)

#define XSPI_SFACR_PRWB_MASK                     (0xF0U)
#define XSPI_SFACR_PRWB_SHIFT                    (4U)
#define XSPI_SFACR_PRWB_WIDTH                    (4U)
#define XSPI_SFACR_PRWB(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_PRWB_SHIFT)) & XSPI_SFACR_PRWB_MASK)

#define XSPI_SFACR_PPWB_MASK                     (0x1F00U)
#define XSPI_SFACR_PPWB_SHIFT                    (8U)
#define XSPI_SFACR_PPWB_WIDTH                    (5U)
#define XSPI_SFACR_PPWB(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_PPWB_SHIFT)) & XSPI_SFACR_PPWB_MASK)

#define XSPI_SFACR_SIOCMDEN_MASK                 (0x4000U)
#define XSPI_SFACR_SIOCMDEN_SHIFT                (14U)
#define XSPI_SFACR_SIOCMDEN_WIDTH                (1U)
#define XSPI_SFACR_SIOCMDEN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_SIOCMDEN_SHIFT)) & XSPI_SFACR_SIOCMDEN_MASK)

#define XSPI_SFACR_RD_PB_EN_MASK                 (0x8000U)
#define XSPI_SFACR_RD_PB_EN_SHIFT                (15U)
#define XSPI_SFACR_RD_PB_EN_WIDTH                (1U)
#define XSPI_SFACR_RD_PB_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_RD_PB_EN_SHIFT)) & XSPI_SFACR_RD_PB_EN_MASK)

#define XSPI_SFACR_WA_MASK                       (0x10000U)
#define XSPI_SFACR_WA_SHIFT                      (16U)
#define XSPI_SFACR_WA_WIDTH                      (1U)
#define XSPI_SFACR_WA(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_WA_SHIFT)) & XSPI_SFACR_WA_MASK)

#define XSPI_SFACR_BYTE_SWAP_MASK                (0x20000U)
#define XSPI_SFACR_BYTE_SWAP_SHIFT               (17U)
#define XSPI_SFACR_BYTE_SWAP_WIDTH               (1U)
#define XSPI_SFACR_BYTE_SWAP(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_BYTE_SWAP_SHIFT)) & XSPI_SFACR_BYTE_SWAP_MASK)

#define XSPI_SFACR_RX_BP_EN_MASK                 (0x40000U)
#define XSPI_SFACR_RX_BP_EN_SHIFT                (18U)
#define XSPI_SFACR_RX_BP_EN_WIDTH                (1U)
#define XSPI_SFACR_RX_BP_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_RX_BP_EN_SHIFT)) & XSPI_SFACR_RX_BP_EN_MASK)

#define XSPI_SFACR_TBDRGTEN_MASK                 (0x80000U)
#define XSPI_SFACR_TBDRGTEN_SHIFT                (19U)
#define XSPI_SFACR_TBDRGTEN_WIDTH                (1U)
#define XSPI_SFACR_TBDRGTEN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_TBDRGTEN_SHIFT)) & XSPI_SFACR_TBDRGTEN_MASK)

#define XSPI_SFACR_CAS_INTRLVD_MASK              (0x100000U)
#define XSPI_SFACR_CAS_INTRLVD_SHIFT             (20U)
#define XSPI_SFACR_CAS_INTRLVD_WIDTH             (1U)
#define XSPI_SFACR_CAS_INTRLVD(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_CAS_INTRLVD_SHIFT)) & XSPI_SFACR_CAS_INTRLVD_MASK)

#define XSPI_SFACR_WA_4B_EN_MASK                 (0x200000U)
#define XSPI_SFACR_WA_4B_EN_SHIFT                (21U)
#define XSPI_SFACR_WA_4B_EN_WIDTH                (1U)
#define XSPI_SFACR_WA_4B_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_SFACR_WA_4B_EN_SHIFT)) & XSPI_SFACR_WA_4B_EN_MASK)

