zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_FR_RDADDR_MASK                      (0x2U)
#define XSPI_FR_RDADDR_SHIFT                     (1U)
#define XSPI_FR_RDADDR_WIDTH                     (1U)
#define XSPI_FR_RDADDR(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RDADDR_SHIFT)) & XSPI_FR_RDADDR_MASK)

#define XSPI_FR_PERFOVF_MASK                     (0x4U)
#define XSPI_FR_PERFOVF_SHIFT                    (2U)
#define XSPI_FR_PERFOVF_WIDTH                    (1U)
#define XSPI_FR_PERFOVF(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PERFOVF_SHIFT)) & XSPI_FR_PERFOVF_MASK)

#define XSPI_FR_IPEDERR_MASK                     (0x20U)
#define XSPI_FR_IPEDERR_SHIFT                    (5U)
#define XSPI_FR_IPEDERR_WIDTH                    (1U)
#define XSPI_FR_IPEDERR(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FR_IPEDERR_SHIFT)) & XSPI_FR_IPEDERR_MASK)

#define XSPI_FR_IPIEF_MASK                       (0x40U)
#define XSPI_FR_IPIEF_SHIFT                      (6U)
#define XSPI_FR_IPIEF_WIDTH                      (1U)
#define XSPI_FR_IPIEF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_IPIEF_SHIFT)) & XSPI_FR_IPIEF_MASK)

#define XSPI_FR_PPWF_MASK                        (0x100U)
#define XSPI_FR_PPWF_SHIFT                       (8U)
#define XSPI_FR_PPWF_WIDTH                       (1U)
#define XSPI_FR_PPWF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PPWF_SHIFT)) & XSPI_FR_PPWF_MASK)

#define XSPI_FR_CRCAEF_MASK                      (0x400U)
#define XSPI_FR_CRCAEF_SHIFT                     (10U)
#define XSPI_FR_CRCAEF_WIDTH                     (1U)
#define XSPI_FR_CRCAEF(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_CRCAEF_SHIFT)) & XSPI_FR_CRCAEF_MASK)

#define XSPI_FR_ABOF_MASK                        (0x1000U)
#define XSPI_FR_ABOF_SHIFT                       (12U)
#define XSPI_FR_ABOF_WIDTH                       (1U)
#define XSPI_FR_ABOF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_ABOF_SHIFT)) & XSPI_FR_ABOF_MASK)

#define XSPI_FR_AIBSEF_MASK                      (0x2000U)
#define XSPI_FR_AIBSEF_SHIFT                     (13U)
#define XSPI_FR_AIBSEF_WIDTH                     (1U)
#define XSPI_FR_AIBSEF(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AIBSEF_SHIFT)) & XSPI_FR_AIBSEF_MASK)

#define XSPI_FR_AITEF_MASK                       (0x4000U)
#define XSPI_FR_AITEF_SHIFT                      (14U)
#define XSPI_FR_AITEF_WIDTH                      (1U)
#define XSPI_FR_AITEF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AITEF_SHIFT)) & XSPI_FR_AITEF_MASK)

#define XSPI_FR_AAEF_MASK                        (0x8000U)
#define XSPI_FR_AAEF_SHIFT                       (15U)
#define XSPI_FR_AAEF_WIDTH                       (1U)
#define XSPI_FR_AAEF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AAEF_SHIFT)) & XSPI_FR_AAEF_MASK)

#define XSPI_FR_RBDF_MASK                        (0x10000U)
#define XSPI_FR_RBDF_SHIFT                       (16U)
#define XSPI_FR_RBDF_WIDTH                       (1U)
#define XSPI_FR_RBDF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RBDF_SHIFT)) & XSPI_FR_RBDF_MASK)

#define XSPI_FR_RBOF_MASK                        (0x20000U)
#define XSPI_FR_RBOF_SHIFT                       (17U)
#define XSPI_FR_RBOF_WIDTH                       (1U)
#define XSPI_FR_RBOF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RBOF_SHIFT)) & XSPI_FR_RBOF_MASK)

#define XSPI_FR_PECMDF_MASK                      (0x200000U)
#define XSPI_FR_PECMDF_SHIFT                     (21U)
#define XSPI_FR_PECMDF_WIDTH                     (1U)
#define XSPI_FR_PECMDF(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PECMDF_SHIFT)) & XSPI_FR_PECMDF_MASK)

#define XSPI_FR_ILLACC_MASK                      (0x400000U)
#define XSPI_FR_ILLACC_SHIFT                     (22U)
#define XSPI_FR_ILLACC_WIDTH                     (1U)
#define XSPI_FR_ILLACC(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_ILLACC_SHIFT)) & XSPI_FR_ILLACC_MASK)

#define XSPI_FR_ILLINE_MASK                      (0x800000U)
#define XSPI_FR_ILLINE_SHIFT                     (23U)
#define XSPI_FR_ILLINE_WIDTH                     (1U)
#define XSPI_FR_ILLINE(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_ILLINE_SHIFT)) & XSPI_FR_ILLINE_MASK)

#define XSPI_FR_DLLUNLCK_MASK                    (0x1000000U)
#define XSPI_FR_DLLUNLCK_SHIFT                   (24U)
#define XSPI_FR_DLLUNLCK_WIDTH                   (1U)
#define XSPI_FR_DLLUNLCK(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLLUNLCK_SHIFT)) & XSPI_FR_DLLUNLCK_MASK)

#define XSPI_FR_PRWF_MASK                        (0x2000000U)
#define XSPI_FR_PRWF_SHIFT                       (25U)
#define XSPI_FR_PRWF_WIDTH                       (1U)
#define XSPI_FR_PRWF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PRWF_SHIFT)) & XSPI_FR_PRWF_MASK)

#define XSPI_FR_TBUF_MASK                        (0x4000000U)
#define XSPI_FR_TBUF_SHIFT                       (26U)
#define XSPI_FR_TBUF_WIDTH                       (1U)
#define XSPI_FR_TBUF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_TBUF_SHIFT)) & XSPI_FR_TBUF_MASK)

#define XSPI_FR_TBFF_MASK                        (0x8000000U)
#define XSPI_FR_TBFF_SHIFT                       (27U)
#define XSPI_FR_TBFF_WIDTH                       (1U)
#define XSPI_FR_TBFF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_TBFF_SHIFT)) & XSPI_FR_TBFF_MASK)

#define XSPI_FR_DLLABRT_MASK                     (0x10000000U)
#define XSPI_FR_DLLABRT_SHIFT                    (28U)
#define XSPI_FR_DLLABRT_WIDTH                    (1U)
#define XSPI_FR_DLLABRT(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLLABRT_SHIFT)) & XSPI_FR_DLLABRT_MASK)

#define XSPI_FR_DLPFF_MASK                       (0x80000000U)
#define XSPI_FR_DLPFF_SHIFT                      (31U)
#define XSPI_FR_DLPFF_WIDTH                      (1U)
#define XSPI_FR_DLPFF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLPFF_SHIFT)) & XSPI_FR_DLPFF_MASK)
/*! @} */

/*! @name RSER - Interrupt and DMA Request Enable */
/*! @{ */

#define XSPI_RSER_TFIE_MASK                      (0x1U)
#define XSPI_RSER_TFIE_SHIFT                     (0U)
#define XSPI_RSER_TFIE_WIDTH                     (1U)
#define XSPI_RSER_TFIE(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_TFIE_SHIFT)) & XSPI_RSER_TFIE_MASK)

#define XSPI_RSER_RDADDRIE_MASK                  (0x2U)
#define XSPI_RSER_RDADDRIE_SHIFT                 (1U)
#define XSPI_RSER_RDADDRIE_WIDTH                 (1U)
#define XSPI_RSER_RDADDRIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_RDADDRIE_SHIFT)) & XSPI_RSER_RDADDRIE_MASK)

#define XSPI_RSER_PERFOVIE_MASK                  (0x4U)
#define XSPI_RSER_PERFOVIE_SHIFT                 (2U)
#define XSPI_RSER_PERFOVIE_WIDTH                 (1U)
#define XSPI_RSER_PERFOVIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_PERFOVIE_SHIFT)) & XSPI_RSER_PERFOVIE_MASK)

#define XSPI_RSER_IPEDIE_MASK                    (0x20U)
#define XSPI_RSER_IPEDIE_SHIFT                   (5U)
#define XSPI_RSER_IPEDIE_WIDTH                   (1U)
#define XSPI_RSER_IPEDIE(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_IPEDIE_SHIFT)) & XSPI_RSER_IPEDIE_MASK)

