zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_IPEDCTXSTART_CMR_MASK               (0x3U)
#define XSPI_IPEDCTXSTART_CMR_SHIFT              (0U)
#define XSPI_IPEDCTXSTART_CMR_WIDTH              (2U)
#define XSPI_IPEDCTXSTART_CMR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXSTART_CMR_SHIFT)) & XSPI_IPEDCTXSTART_CMR_MASK)

#define XSPI_IPEDCTXSTART_SADD_MASK              (0xFFFFFF00U)
#define XSPI_IPEDCTXSTART_SADD_SHIFT             (8U)
#define XSPI_IPEDCTXSTART_SADD_WIDTH             (24U)
#define XSPI_IPEDCTXSTART_SADD(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXSTART_SADD_SHIFT)) & XSPI_IPEDCTXSTART_SADD_MASK)
/*! @} */

/*! @name IPEDCTXEND - IPED End Address Region */
/*! @{ */

#define XSPI_IPEDCTXEND_END_ADDRESS_MASK         (0xFFFFFF00U)
#define XSPI_IPEDCTXEND_END_ADDRESS_SHIFT        (8U)
#define XSPI_IPEDCTXEND_END_ADDRESS_WIDTH        (24U)
#define XSPI_IPEDCTXEND_END_ADDRESS(x)           (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXEND_END_ADDRESS_SHIFT)) & XSPI_IPEDCTXEND_END_ADDRESS_MASK)
/*! @} */

/*! @name IPEDCTXAAD - IPED Context Additional Authentication Data */
/*! @{ */

#define XSPI_IPEDCTXAAD_CTX_AAD_MASK             (0xFFFFFFFFU)
#define XSPI_IPEDCTXAAD_CTX_AAD_SHIFT            (0U)
#define XSPI_IPEDCTXAAD_CTX_AAD_WIDTH            (32U)
#define XSPI_IPEDCTXAAD_CTX_AAD(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXAAD_CTX_AAD_SHIFT)) & XSPI_IPEDCTXAAD_CTX_AAD_MASK)
/*! @} */

/*! @name IPEDCTRL - IPED Function Control */
/*! @{ */

#define XSPI_IPEDCTRL_CONFIG_MASK                (0x1U)
#define XSPI_IPEDCTRL_CONFIG_SHIFT               (0U)
#define XSPI_IPEDCTRL_CONFIG_WIDTH               (1U)
#define XSPI_IPEDCTRL_CONFIG(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_CONFIG_SHIFT)) & XSPI_IPEDCTRL_CONFIG_MASK)

#define XSPI_IPEDCTRL_IPED_EN_MASK               (0x2U)
#define XSPI_IPEDCTRL_IPED_EN_SHIFT              (1U)
#define XSPI_IPEDCTRL_IPED_EN_WIDTH              (1U)
#define XSPI_IPEDCTRL_IPED_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_EN_SHIFT)) & XSPI_IPEDCTRL_IPED_EN_MASK)

#define XSPI_IPEDCTRL_IPWR_EN_MASK               (0x4U)
#define XSPI_IPEDCTRL_IPWR_EN_SHIFT              (2U)
#define XSPI_IPEDCTRL_IPWR_EN_WIDTH              (1U)
#define XSPI_IPEDCTRL_IPWR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPWR_EN_SHIFT)) & XSPI_IPEDCTRL_IPWR_EN_MASK)

#define XSPI_IPEDCTRL_AHBWR_EN_MASK              (0x8U)
#define XSPI_IPEDCTRL_AHBWR_EN_SHIFT             (3U)
#define XSPI_IPEDCTRL_AHBWR_EN_WIDTH             (1U)
#define XSPI_IPEDCTRL_AHBWR_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBWR_EN_SHIFT)) & XSPI_IPEDCTRL_AHBWR_EN_MASK)

#define XSPI_IPEDCTRL_AHBRD_EN_MASK              (0x10U)
#define XSPI_IPEDCTRL_AHBRD_EN_SHIFT             (4U)
#define XSPI_IPEDCTRL_AHBRD_EN_WIDTH             (1U)
#define XSPI_IPEDCTRL_AHBRD_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBRD_EN_SHIFT)) & XSPI_IPEDCTRL_AHBRD_EN_MASK)

#define XSPI_IPEDCTRL_IPGCMWR_MASK               (0x40U)
#define XSPI_IPEDCTRL_IPGCMWR_SHIFT              (6U)
#define XSPI_IPEDCTRL_IPGCMWR_WIDTH              (1U)
#define XSPI_IPEDCTRL_IPGCMWR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPGCMWR_SHIFT)) & XSPI_IPEDCTRL_IPGCMWR_MASK)

#define XSPI_IPEDCTRL_AHGCMWR_MASK               (0x80U)
#define XSPI_IPEDCTRL_AHGCMWR_SHIFT              (7U)
#define XSPI_IPEDCTRL_AHGCMWR_WIDTH              (1U)
#define XSPI_IPEDCTRL_AHGCMWR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHGCMWR_SHIFT)) & XSPI_IPEDCTRL_AHGCMWR_MASK)

#define XSPI_IPEDCTRL_AHBGCMRD_MASK              (0x100U)
#define XSPI_IPEDCTRL_AHBGCMRD_SHIFT             (8U)
#define XSPI_IPEDCTRL_AHBGCMRD_WIDTH             (1U)
#define XSPI_IPEDCTRL_AHBGCMRD(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBGCMRD_SHIFT)) & XSPI_IPEDCTRL_AHBGCMRD_MASK)

#define XSPI_IPEDCTRL_IPED_PROTECT_MASK          (0x200U)
#define XSPI_IPEDCTRL_IPED_PROTECT_SHIFT         (9U)
#define XSPI_IPEDCTRL_IPED_PROTECT_WIDTH         (1U)
#define XSPI_IPEDCTRL_IPED_PROTECT(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_PROTECT_SHIFT)) & XSPI_IPEDCTRL_IPED_PROTECT_MASK)

#define XSPI_IPEDCTRL_IPED_SWRESET_MASK          (0x400U)
#define XSPI_IPEDCTRL_IPED_SWRESET_SHIFT         (10U)
#define XSPI_IPEDCTRL_IPED_SWRESET_WIDTH         (1U)
#define XSPI_IPEDCTRL_IPED_SWRESET(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_SWRESET_SHIFT)) & XSPI_IPEDCTRL_IPED_SWRESET_MASK)

#define XSPI_IPEDCTRL_IPED_XEX_EN_MASK           (0x800U)
#define XSPI_IPEDCTRL_IPED_XEX_EN_SHIFT          (11U)
#define XSPI_IPEDCTRL_IPED_XEX_EN_WIDTH          (1U)
#define XSPI_IPEDCTRL_IPED_XEX_EN(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_XEX_EN_SHIFT)) & XSPI_IPEDCTRL_IPED_XEX_EN_MASK)

#define XSPI_IPEDCTRL_IPSXEXWE_MASK              (0x1000U)
#define XSPI_IPEDCTRL_IPSXEXWE_SHIFT             (12U)
#define XSPI_IPEDCTRL_IPSXEXWE_WIDTH             (1U)
#define XSPI_IPEDCTRL_IPSXEXWE(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPSXEXWE_SHIFT)) & XSPI_IPEDCTRL_IPSXEXWE_MASK)

#define XSPI_IPEDCTRL_AHBXEXWE_MASK              (0x2000U)
#define XSPI_IPEDCTRL_AHBXEXWE_SHIFT             (13U)
#define XSPI_IPEDCTRL_AHBXEXWE_WIDTH             (1U)
#define XSPI_IPEDCTRL_AHBXEXWE(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBXEXWE_SHIFT)) & XSPI_IPEDCTRL_AHBXEXWE_MASK)

#define XSPI_IPEDCTRL_AHBXEXRE_MASK              (0x4000U)
#define XSPI_IPEDCTRL_AHBXEXRE_SHIFT             (14U)
#define XSPI_IPEDCTRL_AHBXEXRE_WIDTH             (1U)
#define XSPI_IPEDCTRL_AHBXEXRE(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBXEXRE_SHIFT)) & XSPI_IPEDCTRL_AHBXEXRE_MASK)

#define XSPI_IPEDCTRL_IPS_GCM_MASK               (0x10000U)
#define XSPI_IPEDCTRL_IPS_GCM_SHIFT              (16U)
#define XSPI_IPEDCTRL_IPS_GCM_WIDTH              (1U)
#define XSPI_IPEDCTRL_IPS_GCM(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPS_GCM_SHIFT)) & XSPI_IPEDCTRL_IPS_GCM_MASK)
/*! @} */

/*! @name IPEDCTXCTRL - IPED Context Control 0..IPED Context Control 1 */
/*! @{ */

#define XSPI_IPEDCTXCTRL_CTX0_FREEZE_MASK        (0x3U)
#define XSPI_IPEDCTXCTRL_CTX0_FREEZE_SHIFT       (0U)
#define XSPI_IPEDCTXCTRL_CTX0_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX0_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX0_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX0_FREEZE_MASK)

