zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_IPEDCTXCTRL_CTX1_FREEZE_MASK        (0xCU)
#define XSPI_IPEDCTXCTRL_CTX1_FREEZE_SHIFT       (2U)
#define XSPI_IPEDCTXCTRL_CTX1_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX1_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX1_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX1_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX2_FREEZE_MASK        (0x30U)
#define XSPI_IPEDCTXCTRL_CTX2_FREEZE_SHIFT       (4U)
#define XSPI_IPEDCTXCTRL_CTX2_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX2_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX2_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX2_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX3_FREEZE_MASK        (0xC0U)
#define XSPI_IPEDCTXCTRL_CTX3_FREEZE_SHIFT       (6U)
#define XSPI_IPEDCTXCTRL_CTX3_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX3_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX3_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX3_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX4_FREEZE_MASK        (0x300U)
#define XSPI_IPEDCTXCTRL_CTX4_FREEZE_SHIFT       (8U)
#define XSPI_IPEDCTXCTRL_CTX4_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX4_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX4_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX4_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX5_FREEZE_MASK        (0xC00U)
#define XSPI_IPEDCTXCTRL_CTX5_FREEZE_SHIFT       (10U)
#define XSPI_IPEDCTXCTRL_CTX5_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX5_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX5_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX5_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX6_FREEZE_MASK        (0x3000U)
#define XSPI_IPEDCTXCTRL_CTX6_FREEZE_SHIFT       (12U)
#define XSPI_IPEDCTXCTRL_CTX6_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX6_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX6_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX6_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX7_FREEZE_MASK        (0xC000U)
#define XSPI_IPEDCTXCTRL_CTX7_FREEZE_SHIFT       (14U)
#define XSPI_IPEDCTXCTRL_CTX7_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX7_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX7_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX7_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX8_FREEZE_MASK        (0x30000U)
#define XSPI_IPEDCTXCTRL_CTX8_FREEZE_SHIFT       (16U)
#define XSPI_IPEDCTXCTRL_CTX8_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX8_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX8_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX8_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX9_FREEZE_MASK        (0xC0000U)
#define XSPI_IPEDCTXCTRL_CTX9_FREEZE_SHIFT       (18U)
#define XSPI_IPEDCTXCTRL_CTX9_FREEZE_WIDTH       (2U)
#define XSPI_IPEDCTXCTRL_CTX9_FREEZE(x)          (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX9_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX9_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX10_FREEZE_MASK       (0x300000U)
#define XSPI_IPEDCTXCTRL_CTX10_FREEZE_SHIFT      (20U)
#define XSPI_IPEDCTXCTRL_CTX10_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX10_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX10_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX10_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX11_FREEZE_MASK       (0xC00000U)
#define XSPI_IPEDCTXCTRL_CTX11_FREEZE_SHIFT      (22U)
#define XSPI_IPEDCTXCTRL_CTX11_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX11_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX11_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX11_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX12_FREEZE_MASK       (0x3000000U)
#define XSPI_IPEDCTXCTRL_CTX12_FREEZE_SHIFT      (24U)
#define XSPI_IPEDCTXCTRL_CTX12_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX12_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX12_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX12_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX13_FREEZE_MASK       (0xC000000U)
#define XSPI_IPEDCTXCTRL_CTX13_FREEZE_SHIFT      (26U)
#define XSPI_IPEDCTXCTRL_CTX13_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX13_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX13_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX13_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX14_FREEZE_MASK       (0x30000000U)
#define XSPI_IPEDCTXCTRL_CTX14_FREEZE_SHIFT      (28U)
#define XSPI_IPEDCTXCTRL_CTX14_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX14_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX14_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX14_FREEZE_MASK)

#define XSPI_IPEDCTXCTRL_CTX15_FREEZE_MASK       (0xC0000000U)
#define XSPI_IPEDCTXCTRL_CTX15_FREEZE_SHIFT      (30U)
#define XSPI_IPEDCTXCTRL_CTX15_FREEZE_WIDTH      (2U)
#define XSPI_IPEDCTXCTRL_CTX15_FREEZE(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXCTRL_CTX15_FREEZE_SHIFT)) & XSPI_IPEDCTXCTRL_CTX15_FREEZE_MASK)
/*! @} */

/*! @name AWR_WRAP_STATUS - AHB Write Wrap Status */
/*! @{ */

#define XSPI_AWR_WRAP_STATUS_WWEBTMID_MASK       (0x3FU)
#define XSPI_AWR_WRAP_STATUS_WWEBTMID_SHIFT      (0U)
#define XSPI_AWR_WRAP_STATUS_WWEBTMID_WIDTH      (6U)
#define XSPI_AWR_WRAP_STATUS_WWEBTMID(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_AWR_WRAP_STATUS_WWEBTMID_SHIFT)) & XSPI_AWR_WRAP_STATUS_WWEBTMID_MASK)

#define XSPI_AWR_WRAP_STATUS_WWARLMID_MASK       (0x3F00U)
#define XSPI_AWR_WRAP_STATUS_WWARLMID_SHIFT      (8U)
#define XSPI_AWR_WRAP_STATUS_WWARLMID_WIDTH      (6U)
#define XSPI_AWR_WRAP_STATUS_WWARLMID(x)         (((uint32_t)(((uint32_t)(x)) << XSPI_AWR_WRAP_STATUS_WWARLMID_SHIFT)) & XSPI_AWR_WRAP_STATUS_WWARLMID_MASK)

#define XSPI_AWR_WRAP_STATUS_WWMID_MASK          (0xFC000U)
#define XSPI_AWR_WRAP_STATUS_WWMID_SHIFT         (14U)
#define XSPI_AWR_WRAP_STATUS_WWMID_WIDTH         (6U)
#define XSPI_AWR_WRAP_STATUS_WWMID(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_AWR_WRAP_STATUS_WWMID_SHIFT)) & XSPI_AWR_WRAP_STATUS_WWMID_MASK)
/*! @} */

/*! @name AHB_WW_ERR_ADDR_EBT - Write Wrap Burst Error Address due to Early Termination */
/*! @{ */

