zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XSPI.h
#define XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR_MASK   (0xFFFFFFFFU)
#define XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR_SHIFT  (0U)
#define XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR_WIDTH  (32U)
#define XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR(x)     (((uint32_t)(((uint32_t)(x)) << XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR_SHIFT)) & XSPI_AHB_WW_ERR_ADDR_EBT_WWEBTADR_MASK)
/*! @} */

/*! @name AHB_WW_ERR_ADDR_ARL - Write Wrap Burst Error Address due to Arbitration Lock */
/*! @{ */

#define XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR_MASK   (0xFFFFFFFFU)
#define XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR_SHIFT  (0U)
#define XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR_WIDTH  (32U)
#define XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR(x)     (((uint32_t)(((uint32_t)(x)) << XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR_SHIFT)) & XSPI_AHB_WW_ERR_ADDR_ARL_WWARLADR_MASK)
/*! @} */

/*! @name AHB_WW_ERR_ADDR - AHB Write Wrap Burst Error Address */
/*! @{ */

#define XSPI_AHB_WW_ERR_ADDR_WWADR_MASK          (0xFFFFFFFFU)
#define XSPI_AHB_WW_ERR_ADDR_WWADR_SHIFT         (0U)
#define XSPI_AHB_WW_ERR_ADDR_WWADR_WIDTH         (32U)
#define XSPI_AHB_WW_ERR_ADDR_WWADR(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_AHB_WW_ERR_ADDR_WWADR_SHIFT)) & XSPI_AHB_WW_ERR_ADDR_WWADR_MASK)
/*! @} */

/*! @name FR2 - Flag 2 */
/*! @{ */

#define XSPI_FR2_WWI_MASK                        (0x1U)
#define XSPI_FR2_WWI_SHIFT                       (0U)
#define XSPI_FR2_WWI_WIDTH                       (1U)
#define XSPI_FR2_WWI(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR2_WWI_SHIFT)) & XSPI_FR2_WWI_MASK)

#define XSPI_FR2_WWI_EBT_MASK                    (0x2U)
#define XSPI_FR2_WWI_EBT_SHIFT                   (1U)
#define XSPI_FR2_WWI_EBT_WIDTH                   (1U)
#define XSPI_FR2_WWI_EBT(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FR2_WWI_EBT_SHIFT)) & XSPI_FR2_WWI_EBT_MASK)

#define XSPI_FR2_WWI_ARL_MASK                    (0x4U)
#define XSPI_FR2_WWI_ARL_SHIFT                   (2U)
#define XSPI_FR2_WWI_ARL_WIDTH                   (1U)
#define XSPI_FR2_WWI_ARL(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FR2_WWI_ARL_SHIFT)) & XSPI_FR2_WWI_ARL_MASK)
/*! @} */

/*! @name RSER2 - Interrupt and DMA Request Enable 2 */
/*! @{ */

#define XSPI_RSER2_WW_IE_MASK                    (0x1U)
#define XSPI_RSER2_WW_IE_SHIFT                   (0U)
#define XSPI_RSER2_WW_IE_WIDTH                   (1U)
#define XSPI_RSER2_WW_IE(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_RSER2_WW_IE_SHIFT)) & XSPI_RSER2_WW_IE_MASK)

#define XSPI_RSER2_WWEBTIE_MASK                  (0x2U)
#define XSPI_RSER2_WWEBTIE_SHIFT                 (1U)
#define XSPI_RSER2_WWEBTIE_WIDTH                 (1U)
#define XSPI_RSER2_WWEBTIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER2_WWEBTIE_SHIFT)) & XSPI_RSER2_WWEBTIE_MASK)

#define XSPI_RSER2_WWARLIE_MASK                  (0x4U)
#define XSPI_RSER2_WWARLIE_SHIFT                 (2U)
#define XSPI_RSER2_WWARLIE_WIDTH                 (1U)
#define XSPI_RSER2_WWARLIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER2_WWARLIE_SHIFT)) & XSPI_RSER2_WWARLIE_MASK)
/*! @} */

/*! @name ARSWRST_ADDR - AHB Read Burst Address on Soft Reset */
/*! @{ */

#define XSPI_ARSWRST_ADDR_ARSWRSTA_MASK          (0xFFFFFFFFU)
#define XSPI_ARSWRST_ADDR_ARSWRSTA_SHIFT         (0U)
#define XSPI_ARSWRST_ADDR_ARSWRSTA_WIDTH         (32U)
#define XSPI_ARSWRST_ADDR_ARSWRSTA(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_ARSWRST_ADDR_ARSWRSTA_SHIFT)) & XSPI_ARSWRST_ADDR_ARSWRSTA_MASK)
/*! @} */

/*! @name ARSWRST_MID - AHB Read Burst Initiator ID on Soft Reset */
/*! @{ */

#define XSPI_ARSWRST_MID_ARSWRSTM_MASK           (0x3FU)
#define XSPI_ARSWRST_MID_ARSWRSTM_SHIFT          (0U)
#define XSPI_ARSWRST_MID_ARSWRSTM_WIDTH          (6U)
#define XSPI_ARSWRST_MID_ARSWRSTM(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_ARSWRST_MID_ARSWRSTM_SHIFT)) & XSPI_ARSWRST_MID_ARSWRSTM_MASK)
/*! @} */

/*! @name AWSWRST_ADDR - AHB Write Burst Address on Soft Reset */
/*! @{ */

#define XSPI_AWSWRST_ADDR_AWSWRSTA_MASK          (0xFFFFFFFFU)
#define XSPI_AWSWRST_ADDR_AWSWRSTA_SHIFT         (0U)
#define XSPI_AWSWRST_ADDR_AWSWRSTA_WIDTH         (32U)
#define XSPI_AWSWRST_ADDR_AWSWRSTA(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_AWSWRST_ADDR_AWSWRSTA_SHIFT)) & XSPI_AWSWRST_ADDR_AWSWRSTA_MASK)
/*! @} */

/*! @name FRAD0_WORD0 - Flash Region Word 0 - Start Address */
/*! @{ */

#define XSPI_FRAD0_WORD0_STARTADR_MASK           (0xFFFF0000U)
#define XSPI_FRAD0_WORD0_STARTADR_SHIFT          (16U)
#define XSPI_FRAD0_WORD0_STARTADR_WIDTH          (16U)
#define XSPI_FRAD0_WORD0_STARTADR(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD0_STARTADR_SHIFT)) & XSPI_FRAD0_WORD0_STARTADR_MASK)
/*! @} */

/*! @name FRAD0_WORD1 - Flash Region Word 1 - End Address */
/*! @{ */

#define XSPI_FRAD0_WORD1_ENDADR_MASK             (0xFFFF0000U)
#define XSPI_FRAD0_WORD1_ENDADR_SHIFT            (16U)
#define XSPI_FRAD0_WORD1_ENDADR_WIDTH            (16U)
#define XSPI_FRAD0_WORD1_ENDADR(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD1_ENDADR_SHIFT)) & XSPI_FRAD0_WORD1_ENDADR_MASK)
/*! @} */

/*! @name FRAD0_WORD2 - Flash Region Word 2 - Privileges */
/*! @{ */

#define XSPI_FRAD0_WORD2_MD0ACP_MASK             (0x7U)
#define XSPI_FRAD0_WORD2_MD0ACP_SHIFT            (0U)
#define XSPI_FRAD0_WORD2_MD0ACP_WIDTH            (3U)
#define XSPI_FRAD0_WORD2_MD0ACP(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD2_MD0ACP_SHIFT)) & XSPI_FRAD0_WORD2_MD0ACP_MASK)

#define XSPI_FRAD0_WORD2_MD1ACP_MASK             (0x38U)
#define XSPI_FRAD0_WORD2_MD1ACP_SHIFT            (3U)
#define XSPI_FRAD0_WORD2_MD1ACP_WIDTH            (3U)
#define XSPI_FRAD0_WORD2_MD1ACP(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD2_MD1ACP_SHIFT)) & XSPI_FRAD0_WORD2_MD1ACP_MASK)

#define XSPI_FRAD0_WORD2_EALO_MASK               (0x3F000000U)
#define XSPI_FRAD0_WORD2_EALO_SHIFT              (24U)
#define XSPI_FRAD0_WORD2_EALO_WIDTH              (6U)
#define XSPI_FRAD0_WORD2_EALO(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD2_EALO_SHIFT)) & XSPI_FRAD0_WORD2_EALO_MASK)
/*! @} */

/*! @name FRAD0_WORD3 - Flash Region Word 3 - Lock Control */
/*! @{ */

#define XSPI_FRAD0_WORD3_EAL_MASK                (0x3000000U)
#define XSPI_FRAD0_WORD3_EAL_SHIFT               (24U)
#define XSPI_FRAD0_WORD3_EAL_WIDTH               (2U)
#define XSPI_FRAD0_WORD3_EAL(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD3_EAL_SHIFT)) & XSPI_FRAD0_WORD3_EAL_MASK)

#define XSPI_FRAD0_WORD3_LOCK_MASK               (0x60000000U)
#define XSPI_FRAD0_WORD3_LOCK_SHIFT              (29U)
#define XSPI_FRAD0_WORD3_LOCK_WIDTH              (2U)
#define XSPI_FRAD0_WORD3_LOCK(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD3_LOCK_SHIFT)) & XSPI_FRAD0_WORD3_LOCK_MASK)

#define XSPI_FRAD0_WORD3_VLD_MASK                (0x80000000U)
#define XSPI_FRAD0_WORD3_VLD_SHIFT               (31U)
#define XSPI_FRAD0_WORD3_VLD_WIDTH               (1U)
#define XSPI_FRAD0_WORD3_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD3_VLD_SHIFT)) & XSPI_FRAD0_WORD3_VLD_MASK)
/*! @} */

/*! @name FRAD0_WORD4 - Flash Region Word 4 - Compare Address Status */
/*! @{ */

#define XSPI_FRAD0_WORD4_CMP_ADDR_MASK           (0xFFFFFFFFU)
#define XSPI_FRAD0_WORD4_CMP_ADDR_SHIFT          (0U)
#define XSPI_FRAD0_WORD4_CMP_ADDR_WIDTH          (32U)
#define XSPI_FRAD0_WORD4_CMP_ADDR(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD4_CMP_ADDR_SHIFT)) & XSPI_FRAD0_WORD4_CMP_ADDR_MASK)
/*! @} */

/*! @name FRAD0_WORD5 - Flash Region Word 5 - Compare Status Data */
/*! @{ */

#define XSPI_FRAD0_WORD5_CMP_MDID_MASK           (0x3FU)
#define XSPI_FRAD0_WORD5_CMP_MDID_SHIFT          (0U)
#define XSPI_FRAD0_WORD5_CMP_MDID_WIDTH          (6U)
#define XSPI_FRAD0_WORD5_CMP_MDID(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD5_CMP_MDID_SHIFT)) & XSPI_FRAD0_WORD5_CMP_MDID_MASK)

#define XSPI_FRAD0_WORD5_CMP_SA_MASK             (0x40U)
#define XSPI_FRAD0_WORD5_CMP_SA_SHIFT            (6U)
#define XSPI_FRAD0_WORD5_CMP_SA_WIDTH            (1U)
#define XSPI_FRAD0_WORD5_CMP_SA(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD5_CMP_SA_SHIFT)) & XSPI_FRAD0_WORD5_CMP_SA_MASK)

#define XSPI_FRAD0_WORD5_CMP_PA_MASK             (0x80U)
#define XSPI_FRAD0_WORD5_CMP_PA_SHIFT            (7U)
#define XSPI_FRAD0_WORD5_CMP_PA_WIDTH            (1U)
#define XSPI_FRAD0_WORD5_CMP_PA(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD5_CMP_PA_SHIFT)) & XSPI_FRAD0_WORD5_CMP_PA_MASK)

#define XSPI_FRAD0_WORD5_CMP_ERR_MASK            (0x20000000U)
#define XSPI_FRAD0_WORD5_CMP_ERR_SHIFT           (29U)
#define XSPI_FRAD0_WORD5_CMP_ERR_WIDTH           (1U)
#define XSPI_FRAD0_WORD5_CMP_ERR(x)              (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD5_CMP_ERR_SHIFT)) & XSPI_FRAD0_WORD5_CMP_ERR_MASK)

#define XSPI_FRAD0_WORD5_CMPVALID_MASK           (0x40000000U)
#define XSPI_FRAD0_WORD5_CMPVALID_SHIFT          (30U)
#define XSPI_FRAD0_WORD5_CMPVALID_WIDTH          (1U)
#define XSPI_FRAD0_WORD5_CMPVALID(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD0_WORD5_CMPVALID_SHIFT)) & XSPI_FRAD0_WORD5_CMPVALID_MASK)
/*! @} */

/*! @name FRAD1_WORD0 - Flash Region Word 0 - Start Address */
/*! @{ */

#define XSPI_FRAD1_WORD0_STARTADR_MASK           (0xFFFF0000U)
#define XSPI_FRAD1_WORD0_STARTADR_SHIFT          (16U)
#define XSPI_FRAD1_WORD0_STARTADR_WIDTH          (16U)
#define XSPI_FRAD1_WORD0_STARTADR(x)             (((uint32_t)(((uint32_t)(x)) << XSPI_FRAD1_WORD0_STARTADR_SHIFT)) & XSPI_FRAD1_WORD0_STARTADR_MASK)
/*! @} */

